In [1]:
print("Hello World!")

Hello World!

In [1]:
print("Hello World!")

Hello World!

In [1]:
numbers = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [4]:
my_list = [1, 2, 3]
my_list.append(4) 
print(my_list)

[1, 2, 3, 4]

In [15]:
my_list.insert(1, "a")  
print(my_list)

[1, 'a', 2, 3, 4, 5, 6, 7, 5, 6, 7, 5, 6, 7]

In [16]:
my_list.extend([5, 6, 7]) 
my_list

[1, 'a', 2, 3, 4, 5, 6, 7, 5, 6, 7, 5, 6, 7, 5, 6, 7]

In [17]:
my_list.remove("a") 
my_list

[1, 2, 3, 4, 5, 6, 7, 5, 6, 7, 5, 6, 7, 5, 6, 7]

In [18]:
last_item = my_list.pop()  
last_item

7

In [20]:
my_list.clear()  # []
my_list

[]

In [22]:
my_list = [1, 2, 3]
my_list[1] = "new_value" 
my_list

[1, 'new_value', 3]

In [23]:
my_list = [1, 2, 3]
my_list[1] = "new_value" 
my_list

[1, 'new_value', 3]

In [26]:
my_list = [3, 1, 4, 1, 5]
my_list.sort() 
my_list.sort(reverse=True)  
my_list

[5, 4, 3, 1, 1]

In [27]:
new_list = sorted(my_list)  
new_list

[1, 1, 3, 4, 5]

In [31]:
my_list.reverse()  # modifies my_list to be in reverse order
my_list

[5, 4, 3, 1, 1]

In [1]:
# Creating a tuple
my_tuple = (1, 2, 3, "apple", "banana")
my_tuple

(1, 2, 3, 'apple', 'banana')

In [3]:
# Creating a tuple without parentheses
my_tuple = 1, 2, 3, "apple", "banana"
my_tuple

(1, 2, 3, 'apple', 'banana')

In [4]:
# Accessing elements
print(my_tuple[0])  
print(my_tuple[3])

1
apple

In [6]:
tuple1 = (1, 2, 3)
tuple2 = (4, 5, 6)
combined = tuple1 + tuple2  
combined

(1, 2, 3, 4, 5, 6)

In [8]:
repeated = tuple1 * 2 
repeated

(1, 2, 3, 1, 2, 3)

In [9]:
slice_tuple = my_tuple[1:4]  
slice_tuple

(2, 3, 'apple')

In [10]:
my_tuple = (1, 2, 2, 3)
print(my_tuple.count(2))  # Output: 2

2

In [11]:
print(my_tuple.index(2))

1

In [13]:
for i in range(5):
    print(i)

0
1
2
3
4

In [14]:
for i in range(2, 6):
    print(i)

2
3
4
5

In [24]:
for x in range(2,30,2):
    print(x)

2
4
6
8
10
12
14
16
18
20
22
24
26
28

In [2]:
myfruit = ('orange', 'mango','guava','melon')
newfruit = list(myfruit)
newfruit[2] = "Grape"
print(newfruit)

['orange', 'mango', 'Grape', 'melon']

In [3]:
myfruit = tuple(newfruit)
print(myfruit)

('orange', 'mango', 'Grape', 'melon')

In [10]:
Theperson = {"name": "Alice","age": 25,"city": "New York"}

print(Theperson)

{'name': 'Alice', 'age': 25, 'city': 'New York'}

In [9]:
print(Theperson.keys())

dict_keys(['name', 'age', 'city'])

In [11]:
print(Theperson.values())

dict_values(['Alice', 25, 'New York'])

In [3]:
my_dict = {
    'name': 'John',
    'age': 30,
    'city': 'New York'
}

my_list  = list(my_dict.keys())
mydict_2 = my_list[2]
print(mydict_2)

city

In [1]:
my_dict = {
    'name': 'John',
    'age': 30,
    'city': 'New York'
}

my_list  = list(my_dict.values())
mydict_2 = my_list[2]
print(mydict_2)

New York

In [2]:
# Function definition
def add_numbers(a, b):
    return a + b  # Returns the sum of a and b

# Function call
result = add_numbers(3, 5)
print(result)  # Output: 8

8

In [5]:
def create_function():
    print("Hello Analyst from a function")
create_function()

Hello Analyst from a function

In [6]:
def greet(name, age):
    print(f"Hello, {name}. You are {age} years old.")

greet("Alice", 25)  # Output: Hello, Alice. You are 25 years old.

Hello, Alice. You are 25 years old.

In [8]:
def create_function(FirstName):
    print(FirstName + " Doe")

create_function("John")
create_function("Sam")
create_function("Luke")

John Doe
Sam Doe
Luke Doe

In [9]:
def create_function(*animal):
    print("The animal with sound meow is " + animal[2])

create_function("Dog", "Goat", "Cat")

The animal with sound meow is Cat

In [11]:
def my_function(**animal):
    print("The animal with sound meow is " + animal["cat"])

my_function(dog = "Woof", cat = "Meow")

The animal with sound meow is Meow

In [13]:
def display_list(the_list):
    for _item in the_list:
        print(_item)

ValueNumbers = [1, 2, 3, 4, 5]
print_list(ValueNumbers)

1
2
3
4
5

In [14]:
def add(a, b):
    return a + b

result = add(3, 4)
print(result)  # Output: 7

7

In [15]:
def let_function(x):
    return 15 * x

print(let_function(2))
print(let_function(3))
print(let_function(4))

30
45
60

In [5]:
for x in range(11):
    print(x)

0
1
2
3
4
5
6
7
8
9
10

In [8]:
# Example: Iterating over a string
for char in "Python":
    print(char)

P
y
t
h
o
n

In [9]:
# Example: Iterating with a condition
count = 0
while count < 5:
    print(count)
    count += 1
# Output:
# 0
# 1
# 2
# 3
# 4

0
1
2
3
4

In [11]:
# Example: Iterating with a condition
count = 0
while count < 5:
    print(count)
    count += 1

0
1
2
3
4

In [14]:
# Example: Iterating through keys and values
person = {"name": "John Doe", "role": "Developer", "age": 30}

for key, value in person.items():
    print(f"{key}: {value}")

name: John Doe
role: Developer
age: 30

In [2]:
fruits = ["pineapp", "apple", "guava"]
for x in fruits:
    if x == "apple":
        continue
    print(x)

pineapp
guava

In [4]:
for num in range(10):
    if num % 2 == 0:  
        continue       
    print(num)

1
3
5
7
9

In [5]:
i = 0
while i < 10:
    i += 1
    if i % 3 == 0:  # Skip numbers divisible by 3
        continue
    print(i)

1
2
4
5
7
8
10

In [1]:
class Person:
    def __init__(self, name, age):
        self.name = name
        self.age = age

    def __str__(self):
        return f"{self.name}({self.age})"

p1 = Person("John", 36)

print(p1)

John(36)

In [7]:
class SchoolDev:
    def __init__(self, name, course):
        self.name =  name
        self.course = course
        
    def __str__(self):
        return f"{self.name}({self.course})"
student = SchoolDev("Wonder", "Data Science")
print(student)

Wonder(Data Science)

In [2]:
import pandas as pd

In [2]:
grocery = pd.Series([10, 5, 12], index=['Apples', 'Oranges', 'Bananas'])

print(grocery)

Apples     10
Oranges     5
Bananas    12
dtype: int64

In [8]:
grocery['Oranges']

5

In [9]:
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [13]:
import pandas as pd

# Create a DataFrame
myinfo = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [25, 30, 35],
        'City': ['New York', 'Los Angeles', 'Chicago']}
df_info = pd.DataFrame(myinfo)
# display result
df_info

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [15]:
productInfo = {
    'Product': ['Laptop', 'Smartphone', 'Tablet', 'Headphones'],
    'Price': [1200, 800, 300, 100],
    'Stock': [10, 25, 15, 50]
}

inventory = pd.DataFrame(productInfo)
inventory

      Product  Price  Stock
0      Laptop   1200     10
1  Smartphone    800     25
2      Tablet    300     15
3  Headphones    100     50

In [19]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [1, 2, 4], 'Score': [85, 90, 75]})

# Merge on the 'ID' column
merged_inner = pd.merge(df1, df2, on='ID', how='inner')  # Default is inner join
merged_left = pd.merge(df1, df2, on='ID', how='left')

print("Inner Merge:")
merged_inner

Inner Merge:

   ID   Name  Score
0   1  Alice     85
1   2    Bob     90

In [20]:
df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [90, 85, 78]})

# Inner Merge
inner_merge = pd.merge(df1, df2, on='ID', how='inner')

inner_merge

   ID     Name  Score
0   2      Bob     90
1   3  Charlie     85

In [21]:
outer_merge = pd.merge(df1, df2, on='ID', how='outer')

outer_merge

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   90.0
2   3  Charlie   85.0
3   4      NaN   78.0

In [24]:
left_merge = pd.merge(df1, df2, on='ID', how='left')

left_merge

   ID     Name  Score
0   1    Alice    NaN
1   2      Bob   90.0
2   3  Charlie   85.0

In [27]:
right_merge = pd.merge(df1, df2, on='ID', how='right')

right_merge

   ID     Name  Score
0   2      Bob     90
1   3  Charlie     85
2   4      NaN     78

In [6]:
df1 = pd.DataFrame({'Name': ['Wonder', 'Paul', 'Bassey']}, index=[1, 2, 3])
print(df1)

     Name
1  Wonder
2    Paul
3  Bassey

In [8]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']}, index=[1, 2, 3])
df2 = pd.DataFrame({'Age': [25, 30, 22]}, index=[1, 2, 4])

# Join the DataFrames
result = df1.join(df2, how='inner')
print(result)

    Name  Age
1  Alice   25
2    Bob   30

In [19]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']}, index=[1, 2, 3])
df2 = pd.DataFrame({'Age': [25, 30, 22]}, index=[1, 2, 4])
result = df1.join(df2, how='outer')  # Keeps all indices
print(result)

      Name   Age
1    Alice  25.0
2      Bob  30.0
3  Charlie   NaN
4      NaN  22.0

In [11]:
result = df1.join(df2, how='left')  # Keeps all indices
print(result)

      Name   Age
1    Alice  25.0
2      Bob  30.0
3  Charlie   NaN

In [12]:
result = df1.join(df2, how='right')  # Keeps all indices
print(result)

    Name  Age
1  Alice   25
2    Bob   30
4    NaN   22

In [21]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']}, index=[1, 2, 3])
df2 = pd.DataFrame({'Age': [25, 30, 22]}, index=[1, 2, 4])
result = pd.concat([df1, df2], axis=0, keys=['df1', 'df2'])

result

          Name   Age
df1 1    Alice   NaN
    2      Bob   NaN
    3  Charlie   NaN
df2 1      NaN  25.0
    2      NaN  30.0
    4      NaN  22.0

In [14]:
result = pd.concat([df1, df2], axis=0, ignore_index=True)
result

      Name   Age
0    Alice   NaN
1      Bob   NaN
2  Charlie   NaN
3      NaN  25.0
4      NaN  30.0
5      NaN  22.0

In [22]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']}, index=[1, 2, 3])
df2 = pd.DataFrame({'Age': [25, 30, 22]}, index=[1, 2, 4])
result = pd.concat([df1, df2], axis=1)
result

      Name   Age
1    Alice  25.0
2      Bob  30.0
3  Charlie   NaN
4      NaN  22.0

In [24]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Charlie']}, index=[1, 2, 3])
df2 = pd.DataFrame({'Age': [25, 30, 22]}, index=[1, 2, 4])
result = pd.concat([df1, df2], axis=0, ignore_index=True)
result

      Name   Age
0    Alice   NaN
1      Bob   NaN
2  Charlie   NaN
3      NaN  25.0
4      NaN  30.0
5      NaN  22.0

In [ ]:
result = pd.concat([df1, df2], axis=0, ignore_index=True)

print(result)

In [2]:
firstname = "Wonder"
lastname = "Bassey"
Name = '''Bassey wonder paul'''
print(Name)

Bassey wonder paul